// 𝐁𝐘 𝐂𝐑𝐀𝐙𝐘 𝐃𝐄𝐕 𝐆𝐈𝐕𝐄 𝐂𝐑𝐄𝐃𝐈𝐓:
//𝐖𝐀.𝐌𝐄/24165730123

const config = require('../config')
const {cmd , commands} = require('../command')
const os = require("os")
const {runtime} = require('../lib/functions')
const axios = require('axios')

cmd({

    pattern: "menu",

    react: "🦄",

    desc: "Get bot command list.",

    category: "main",

    use: '.menu',

    filename: __filename

},

async(conn, mek, m,{from, l, quoted, body, isCmd, umarmd, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply}) => {

try{
let madeMenu = `
*┌─〘 𝗖𝗥𝗔𝗭𝗬 𝗠𝗗 𝗩 ⓵ 〙─◆*
*│╭─────────────❖*
*┴│*
*㋰│↬* *ʀᴜɴᴛɪᴍᴇ* : ${runtime(process.uptime())}
*㋰│↬* *ᴍᴏᴅᴇ* : *${config.MODE}*
*㋰│↬* *ᴘʀᴇғɪx* : *${config.PREFIX}*
*㋰│↬* *ɴᴀᴍᴇ ʙᴏᴛ* : *${config.BOT_NAME}*
*㋰│↬* *ᴄʀᴇᴀᴛᴏʀ* : *𝙘𝙧𝙖𝙯𝙮 𝘿𝙚𝙫🦄*
*㋰│↬* *ᴠᴇʀsɪᴏɴ* : *1.2.0*
*┬│*
*┗━━━━━━━━━━━━━━❖* ${readmore}
*╭──❒⁠⁠⁠⁠* *📡𝗗𝗢𝗪𝗟𝗢𝗔𝗗 𝗖𝗠𝗗📡* *❒⁠⁠⁠⁠* 
*├* *.ғʙ*
*├* *.ɪɴꜱᴛᴀ*
*├* *.ᴠɪᴅᴇᴏ*
*├* *.ɢᴅʀɪᴠᴇ*
*├* *.ᴛᴡɪᴛᴛᴇʀ*
*├* *.ᴛᴛ*
*├* *.ᴍᴇᴅɪᴀғɪʀᴇ*
*├* *.ᴘʟᴀʏ*
*├* *.ᴘʟᴀʏ2*
*├* *.sᴏɴɢ*
*├* *.ᴠɪᴅᴇᴏ*
*├* *.ᴠɪᴅᴇᴏ2*
*├* *.sᴘᴏᴛɪꜰʏ*
*├* *.ᴠɪᴅᴇᴏ4*
*├* *.ɪᴍɢ*
*├* *.Lʏʀɪᴄs*
*├* *.ᴀᴘᴋ*
*├* *.ᴅᴀʀᴀᴍᴀ*
*├* *.ᴘʟᴀʏ2*
*├* *.ᴘʟᴀʏ4*
*├* *.ʙᴀɪsᴄᴏᴘᴇ*
*├* *.ɢɪɴɪsɪsɪʟᴀ*
*┕───────────────────❒*
*╭───❒⁠⁠⁠⁠* *🔎𝗦𝗘𝗔𝗥𝗖𝗛 𝗖𝗠𝗗🔍* *❒⁠⁠⁠⁠* 
*├* *.ʏᴛꜱ*
*├* *.ʏᴛᴀ*
*├* *.ᴍᴏᴠɪᴇɪɴғᴏ*
*├* *.ᴍᴏᴠɪᴇ*
*├* *.Gᴏᴏɢʟᴇ*
*├* *.ᴡᴇᴀᴛʜᴇʀ*
*├* *.sᴛɪᴄᴋsᴇᴀʀᴄʜ*
*┕───────────────────❒*
*╭────❒⁠⁠⁠⁠* *🎮𝗙𝗨𝗡 𝗖𝗠𝗗🎮* *❒⁠⁠⁠⁠* 
*├* *.ɴᴜᴍʙᴇʀɢᴀᴍᴇ*
*├* *.ʀᴏʟʟ🎲*
*├* *.ᴄᴏɪɴꜰʟɪᴘ🪙*
*├* *.pick*
*├* *.ᴋᴏɴᴀᴍɪ*
*├* *.ᴍɪʟʟɪᴏɴɴᴀɪʀᴇ*
*┕───────────────────❒*
*╭───❒⁠⁠⁠⁠* *🔞𝗛𝗢𝗧 𝗖𝗠𝗗🔞* *❒⁠⁠⁠⁠* 
*├* *.ɴsꜰᴡ*
*├* *.Eᴊᴀ*
*├* *.ᴘᴇɴɪs*
*├* *.ᴇʀᴇᴄ*
*├* *.ɴᴜᴅᴇ*
*├* *.sᴇx*
*├* *.ᴄᴜᴛᴇ*
*├* *.ᴏʀɢᴀsᴍ*
*├* *.ᴀɴᴀʟ*
*├* *.sᴜsᴘᴇɴsɪᴏɴ*
*├* *.ᴋɪss*
*┕───────────────────❒*
*╭────❒⁠⁠⁠⁠* *🤖 𝗔𝗜 𝗖𝗠𝗗 🤖* *❒⁠⁠⁠⁠* 
*├* *.ɢᴘᴛ*
*├* *.ᴀɪ*
*├* *.ᴀɴᴀʟʏsᴇ*
*├* *.ʟʟᴀᴍᴀ3*
*┕───────────────────❒*
*╭────❒⁠⁠⁠⁠* *🦄𝗢𝗪𝗡𝗘𝗥 𝗖𝗠𝗗🦄* *❒⁠⁠⁠⁠* 
*├* *.ᴜᴘᴅᴀᴛᴇᴄᴍᴅ*
*├* *.sᴇᴛᴛɪɴɢs*
*├* *.ᴏᴡɴᴇʀ*
*├* *.ʀᴇᴘᴏ*
*├* *.ꜱʏꜱᴛᴇᴍ*
*├* *.ꜱᴛᴀᴛᴜꜱ*
*├* *.Aʙᴏᴜᴛ*
*├* *.ʙʟᴏᴄᴋ*
*├* *.ᴇᴠᴀʟ*
*├* *.ᴜɴʙʟᴏᴄᴋ*
*├* *.sʜᴜᴛᴅᴏᴡɴ*
*├* *.ᴄʟᴇᴀʀᴄʜᴀᴛs*
*├* *.sᴇᴛᴘᴘ*
*├* *.ʙʀᴏᴀᴅᴄᴀsᴛ*
*├* *.ᴊɪᴅ*
*├* *.ɢᴊɪᴅ*
*├* *.ᴘᴀɪʀ*
*├* *.sᴀᴠᴇ*
*├* *.ᴄᴀʟᴄ*
*├* *.ʀᴇꜱᴛᴀʀᴛ*
*┕───────────────────❒*
*╭───❒⁠⁠⁠⁠* *📌𝗚𝗥𝗢𝗨𝗣 𝗖𝗠𝗗📌* *❒⁠⁠⁠⁠* 
*├* *.ʀᴇᴍᴏᴠᴇ*
*├* *.ᴅᴇʟ*
*├* *.ᴀᴅᴅ*
*├* *.ᴋɪᴄᴋ*
*├* *.ᴋɪᴄᴋᴀʟʟ*
*├* *.sᴇᴛɢᴏᴏᴅʙʏᴇ*
*├* *.sᴇᴛᴡᴇʟᴄᴏᴍᴇ*
*├* *.ᴘʀᴏᴍᴏᴛᴇ*
*├* *.ᴅᴇᴍᴏᴛᴇ*
*├* *.ᴛᴀɢᴀʟʟ*
*├* *.ɢᴇᴛᴘɪᴄ*
*├* *.ɪɴᴠɪᴛᴇ*
*├* *.ʀᴇᴠᴏᴋᴇ*
*├* *.ᴊᴏɪɴʀᴇǫᴜᴇsᴛs*
*├* *.ᴀʟʟʀᴇǫ*
*├* *.ᴍᴜᴛᴇ*
*├* *.ᴜɴᴍᴜᴛᴇ*
*├* *.ʟᴏᴄᴋɢᴄ*
*├* *.ᴜɴʟᴏᴄᴋɢᴄ*
*├* *.ʟᴇᴀᴠᴇ*
*├* *.ɢɴᴀᴍᴇ*
*├* *.ɢᴅᴇsᴄ*
*├* *.ᴊᴏɪɴ*
*├* *.ʜɪᴅᴇᴛᴀɢ*
*├* *.ɢɪɴғᴏ*
*├* *.ᴇᴘʜᴇᴍᴇʀᴀʟ ᴏɴ*
*├* *.ᴇᴘʜᴇᴍᴇʀᴀʟ ᴏғғ*
*├* *.ᴇᴘʜᴇᴍᴇʀᴀʟ 7ᴅ 24ʜ 90ᴅ*
*├* *.sᴇɴᴅᴅᴍ*
*┕───────────────────❒*
*╭───❒⁠⁠⁠⁠* *📃 𝗜𝗡𝗙𝗢 𝗖𝗠𝗗 📃* *❒⁠⁠⁠⁠* 
*├* *.Dᴇᴠ*
*├* *.ᴀʟɪᴠᴇ*
*├* *.ʀᴇǫᴜᴇsᴛ*
*├* *.ʙᴏᴛɪɴꜰᴏ*
*├* *.ᴘɪɴɢ*
*├* *.ᴘɪɴɢ2*
*├* *.ꜱʏꜱᴛᴇᴍ*
*┕───────────────────❒*
*╭─❒⁠⁠⁠⁠* *✝️ 𝗥𝗘𝗟𝗜𝗚𝗜𝗢𝗡 𝗖𝗠𝗗 ✝️* *❒⁠⁠⁠⁠* 
*├* *.ʙɪʙʟᴇ*
*├* *.ʙɪʙʟᴇʟɪsᴛ*
*├* *.ʀᴀᴍᴀᴅᴀɴ*
*├* *.ᴄᴏʀᴀɴ*
*├* *.ᴄᴏʀᴀɴʟɪsᴛ*
*┕───────────────────❒*
*╭───❒⁠⁠⁠⁠* *🤖 𝗕𝗢𝗧 𝗖𝗠𝗗 🤖* *❒⁠⁠⁠⁠* 
*├* *.ʀᴇᴘᴏ*
*├* *.ᴍᴇɴᴜ*
*├* *.ᴜᴘᴅᴀᴛᴇ*
*├* *.ᴇɴᴄ* ʜᴀʀᴅ | ᴇᴀsʏ
*┕───────────────────❒*
*╭──❒⁠⁠⁠⁠* *🌟𝗖𝗢𝗡𝗩𝗘𝗥𝗧 𝗖𝗠𝗗🌟* *❒⁠⁠⁠⁠* 
*├* *.sᴛɪᴄᴋᴇʀ*
*├* *.ᴛᴀᴋᴇ*
*├* *.ᴛʀᴛ*
*├* *.ᴛᴛs*
*├* *.ꜰᴀɴᴄʏ*
*├* *.ᴜʀʟ*
*├* *.sᴇɴᴅɪᴍᴀɢᴇ*
*├* *.Cᴏɴᴠᴇʀᴛ*
*├* *.ᴛɪɴʏ*
*├* *.ᴛɢs*
*┕───────────────────❒*
*╭───❒⁠⁠⁠⁠* *🍒𝗥𝗔𝗡𝗗𝗢𝗠 𝗖𝗠𝗗🍒* *❒⁠⁠⁠⁠* 
*├* *.ᴅᴏɢ*
*├* *.ᴄᴀᴛ*
*├* *.ᴅɪᴀʀʏ*
*├* *.ᴀɴɪᴍᴇ*
*├* *.ᴄᴏᴜᴘʟᴇᴘᴘ*
*├* *.ꜰɪɴᴅɴᴀᴍᴇ*
*├* *.ʟᴏʟɪ*
*├* *.ᴡᴀɪꜰᴜ*
*├* *.ᴄᴏsᴘʟᴀʏ*
*├* *.ɴᴇᴋᴏ*
*├* *.ʀᴀɴᴅᴏᴍᴀɴɪᴍᴇ*
*├* *.Sᴇɴᴅɪᴍᴀɢᴇ*
*├* *.ᴀɴɪᴍᴇɢɪʀʟ*
*├* *.ᴀɴɪᴍᴇɢɪʀʟ1*
*├* *.ᴀɴɪᴍᴇɢɪʀʟ2*
*├* *.ᴀɴɪᴍᴇɢɪʀʟ3*
*├* *.ᴀɴɪᴍᴇɢɪʀʟ4*
*├* *.ᴀɴɪᴍᴇɢɪʀʟ5*
*├* *.ᴘɪᴄᴋᴜᴘʟɪɴᴇ*
*┕───────────────────❒*
*╭─❒⁠⁠⁠⁠* *🍓𝗪𝗔𝗟𝗣𝗣𝗘𝗥 𝗖𝗠𝗗🍓* *❒⁠⁠⁠⁠* 
*├* *.ɪᴍɢ*
*├* *.ʟᴏɢᴏ*
*├* *.ss*
*┕───────────────────❒*
*╭────❒⁠⁠⁠⁠* *🎐𝗢𝗧𝗛𝗘𝗥 𝗖𝗠𝗗🎐* *❒⁠⁠⁠⁠* 
*├* *.ᴛʀᴛ*
*├* *.ᴊᴏᴋᴇ*
*├* *.ꜰᴀᴄᴛ*
*├* *.ɢɪᴛʜᴜʙ*
*├* *.ɢᴘᴀꜱꜱ*
*├* *.ʜᴀᴄᴋ*
*├* *.ǫᴜᴏᴛᴇ*
*├* *.vv*
*├* *.sᴘᴀᴍ*
*├* *.ᴠᴄᴀʀᴅ*
*├* *.ꜱʀᴇᴘᴏ*
*├* *.sʏsᴛᴇᴍ*
*├* *.ʀᴀɴᴋ*
*├* *.Tɪᴍᴇᴢᴏɴᴇ*
*├* *.ᴅᴇꜰɪɴᴇ*
*├* *.Dᴀɪʟʏꜰᴀᴄᴛ*
*├* *.Mɪɴᴜᴛᴏʀ*
*├* *.Bᴜɢᴏᴛʜᴇʀ*
*┕───────────────────❒*
*╔═══❖•ೋ° °ೋ•❖═══╗*
*||* *ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴄʀᴀᴢʏ ᴅᴇᴠ*
*╚═══❖•ೋ° °ೋ•❖═══╝*
`
caption: formattedInfo,
            contextInfo: { 
                mentionedJid: [m.sender],
                forwardingScore: 999,
                isForwarded: true,
                forwardedNewsletterMessageInfo: {
                    newsletterJid: '120363411838274335@newsletter',
                    newsletterName: '𝐂𝐑𝐀𝐙𝐘 𝐌𝐃',
                    serverMessageId: 143
                }
            }
        }, { quoted: mek });
   // send audio file with the menu    
        await conn.sendMessage(from, {
            audio: { url: 'https://files.catbox.moe/d8qqch.mp3' },
            mimetype: 'audio/mp4',
            ptt: true,
            contextInfo: { 
                mentionedJid: [m.sender],
                forwardingScore: 999,
                isForwarded: true,
        
await conn.sendMessage(from,{image:{url:config.ALIVE_IMG},caption:madeMenu},{quoted:mek})

}catch(e){
console.log(e)
reply(`${e}`)
}
})
